lighttransport/gemm/cpu/sam3d_body/sam3d_body_runner.c
/* sam3d_body_runner.c — CPU runner for SAM 3D Body.
 *
 * Supports the DINOv3-H+ and ViT-H backbones, raw-image preprocessing,
 * decoder/MHR execution, and ref-dump override paths used by the stage
 * verifiers.
 */

#include "sam3d_body_runner.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#define GGML_DEQUANT_IMPLEMENTATION
#include "ggml_dequant.h"

#define SAFETENSORS_IMPLEMENTATION
#include "safetensors.h"

#define DINOV3_IMPLEMENTATION
#include "dinov3.h"

#define SAM3D_BODY_VIT_IMPLEMENTATION
#include "sam3d_body_vit.h"

#define SAM3D_BODY_DECODER_IMPLEMENTATION
#define SAM3D_BODY_DECODER_FULL_IMPLEMENTATION
#define SAM3D_BODY_MHR_IMPLEMENTATION
#include "sam3d_body_decoder.h"
#include "sam3d_body_mhr.h"

#define SAM3D_BODY_E_OK               (0)
#define SAM3D_BODY_E_INVAL            (-1)
#define SAM3D_BODY_E_NOT_IMPLEMENTED  (-2)
#define SAM3D_BODY_E_LOAD_FAILED      (-3)

#define SAM3D_BODY_ENCODER_SIZE 512
#define SAM3D_BODY_VERTEX_COUNT 18439
#define SAM3D_BODY_KP_COUNT     70

typedef struct {
    float *data;
    int    n, c;
} f32_2d;

struct sam3d_body_ctx {
    sam3d_body_config cfg;

    /* Models (lazy-loaded). */
    dinov3_model              *encoder_model;       /* DINOv3-H+ variant */
    sam3d_body_vit_model      *encoder_model_vith;  /* vit_hmr_512_384 variant */
    sam3d_body_decoder_model  *decoder_model;
    sam3d_body_mhr_assets     *mhr_assets;

    /* Backbone geometry cached at run_encoder so self_drive_decoder_inputs
     * doesn't have to inspect the variant-specific model struct. */
    int enc_grid_h, enc_grid_w;   /* patch grid (32×32 dinov3, 32×24 vith) */
    int enc_n_prefix;             /* 1+n_storage dinov3, 0 vith */
    int enc_image_h, enc_image_w; /* model input dims (512×512 vs 512×384) */

    /* Inputs. */
    uint8_t *image_rgb;  int img_w, img_h;
    float    bbox[4];    int has_bbox;
    uint8_t *mask;       int mask_w, mask_h;
    float   *kp_xy;      int n_kp;
    float    focal_hint;

    /* Self-driven preprocess outputs (set by run_encoder when dec_in_set==0). */
    int       self_pp_set;
    float     self_warp[6];
    float     self_center[2];
    float     self_scale[2];
    float     self_cam_int[9];

    /* Pre-computed decoder inputs (debug-override path; Step 8c-i). */
    int       dec_in_set;
    int       dec_H, dec_W;
    float    *dec_image_emb_chw;     /* (kv_dim, H, W) */
    float    *dec_image_pe_chw;      /* (kv_dim, H, W) */
    float    *dec_init_x;            /* (145, 1024)    */
    float    *dec_init_xpe;          /* (145, 1024)    */
    sam3d_body_camera_batch dec_cam_batch;

    /* Stage outputs (all NULL until the corresponding stage lands). */
    f32_2d   encoder_tokens;   /* [n_tokens, dim] */
    float   *mhr_params;       int mhr_params_n;
    float    cam_t[3];
    float    focal_px;
    float   *vertices;         int n_vertices;   /* V×3 */
    int32_t *faces;            int n_faces;      /* F×3 */
    float   *keypoints_3d;     int n_kp_3d;      /* K×3 */
    float   *keypoints_2d;     int n_kp_2d;      /* K×2 */
};

static void f32_2d_free(f32_2d *b) {
    free(b->data); b->data = NULL; b->n = b->c = 0;
}

static double sam3d_body_time_ms(void)
{
    struct timespec ts;
    clock_gettime(CLOCK_MONOTONIC, &ts);
    return (double)ts.tv_sec * 1000.0 + (double)ts.tv_nsec * 1.0e-6;
}

static int sam3d_body_timing_enabled(const sam3d_body_ctx *ctx)
{
    const char *env = getenv("SAM3D_BODY_TIMING");
    return (ctx && ctx->cfg.verbose) || (env && env[0] && strcmp(env, "0") != 0);
}

sam3d_body_ctx *sam3d_body_create(const sam3d_body_config *cfg)
{
    if (!cfg || !cfg->safetensors_dir) return NULL;
    sam3d_body_ctx *c = (sam3d_body_ctx *)calloc(1, sizeof(*c));
    if (!c) return NULL;
    c->cfg = *cfg;
    if (c->cfg.image_size <= 0) c->cfg.image_size = SAM3D_BODY_ENCODER_SIZE;
    if (c->cfg.image_height <= 0) c->cfg.image_height = c->cfg.image_size;
    if (c->cfg.image_width  <= 0) c->cfg.image_width  = c->cfg.image_size;
    if (c->cfg.n_threads <= 0) {
        const char *env = getenv("OMP_NUM_THREADS");
        c->cfg.n_threads = env ? atoi(env) : 1;
        if (c->cfg.n_threads < 1) c->cfg.n_threads = 1;
    }
    return c;
}

void sam3d_body_destroy(sam3d_body_ctx *ctx)
{
    if (!ctx) return;
    if (ctx->encoder_model) dinov3_free(ctx->encoder_model);
    if (ctx->encoder_model_vith) sam3d_body_vit_free(ctx->encoder_model_vith);
    if (ctx->decoder_model) sam3d_body_decoder_free(ctx->decoder_model);
    if (ctx->mhr_assets)    sam3d_body_mhr_free(ctx->mhr_assets);
    free(ctx->image_rgb);
    free(ctx->mask);
    free(ctx->kp_xy);
    free(ctx->dec_image_emb_chw);
    free(ctx->dec_image_pe_chw);
    free(ctx->dec_init_x);
    free(ctx->dec_init_xpe);
    f32_2d_free(&ctx->encoder_tokens);
    free(ctx->mhr_params);
    free(ctx->vertices);
    free(ctx->faces);
    free(ctx->keypoints_3d);
    free(ctx->keypoints_2d);
    free(ctx);
}

/* Load decoder + MHR-head safetensors; lazy. The decoder + mhr_head weights
 * differ per-variant (verified 2026-04-26: same shapes but values diverge by
 * up to 0.87 max-abs across ckpts), so prefer the variant-tagged slices when
 * present and fall back to the legacy unprefixed names. */
static int file_exists(const char *p) {
    FILE *f = fopen(p, "rb"); if (!f) return 0; fclose(f); return 1;
}
static int ensure_decoder_loaded(sam3d_body_ctx *ctx)
{
    if (ctx->decoder_model) return SAM3D_BODY_E_OK;
    const char *tag = (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_VITH)
                          ? "vith" : "dinov3";
    char path_dec[1024], path_mhr[1024];
    snprintf(path_dec, sizeof(path_dec),
             "%s/sam3d_body_%s_decoder.safetensors",
             ctx->cfg.safetensors_dir, tag);
    snprintf(path_mhr, sizeof(path_mhr),
             "%s/sam3d_body_%s_mhr_head.safetensors",
             ctx->cfg.safetensors_dir, tag);
    if (!file_exists(path_dec)) {
        snprintf(path_dec, sizeof(path_dec),
                 "%s/sam3d_body_decoder.safetensors", ctx->cfg.safetensors_dir);
    }
    if (!file_exists(path_mhr)) {
        snprintf(path_mhr, sizeof(path_mhr),
                 "%s/sam3d_body_mhr_head.safetensors", ctx->cfg.safetensors_dir);
    }
    if (ctx->cfg.verbose) {
        fprintf(stderr, "[sam3d_body] decoder: %s\n[sam3d_body] mhr_head: %s\n",
                path_dec, path_mhr);
    }
    ctx->decoder_model = sam3d_body_decoder_load(path_dec, path_mhr);
    return ctx->decoder_model ? SAM3D_BODY_E_OK : SAM3D_BODY_E_LOAD_FAILED;
}

/* Load MHR skinning assets; lazy. */
static int ensure_mhr_loaded(sam3d_body_ctx *ctx)
{
    if (ctx->mhr_assets) return SAM3D_BODY_E_OK;
    if (!ctx->cfg.mhr_assets_dir) {
        fprintf(stderr, "[sam3d_body] mhr_assets_dir not configured\n");
        return SAM3D_BODY_E_INVAL;
    }
    char path_sft[1024], path_json[1024];
    snprintf(path_sft,  sizeof(path_sft),
             "%s/sam3d_body_mhr_jit.safetensors", ctx->cfg.mhr_assets_dir);
    snprintf(path_json, sizeof(path_json),
             "%s/sam3d_body_mhr_jit.json",        ctx->cfg.mhr_assets_dir);
    ctx->mhr_assets = sam3d_body_mhr_load(path_sft, path_json);
    return ctx->mhr_assets ? SAM3D_BODY_E_OK : SAM3D_BODY_E_LOAD_FAILED;
}

/* ---------------- inputs ---------------- */

