lighttransport/gemm/cpu/sam3d_body/sam3d_body_runner.c
int sam3d_body_set_image(sam3d_body_ctx *ctx, const uint8_t *rgb,
                         int width, int height, const float bbox[4])
{
    if (!ctx || !rgb || width <= 0 || height <= 0) return SAM3D_BODY_E_INVAL;
    size_t bytes = (size_t)width * height * 3;
    free(ctx->image_rgb);
    ctx->image_rgb = (uint8_t *)malloc(bytes);
    if (!ctx->image_rgb) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->image_rgb, rgb, bytes);
    ctx->img_w = width;
    ctx->img_h = height;
    ctx->has_bbox = 0;
    if (bbox) {
        memcpy(ctx->bbox, bbox, sizeof(ctx->bbox));
        ctx->has_bbox = 1;
    }
    return SAM3D_BODY_E_OK;
}

int sam3d_body_set_keypoints_2d(sam3d_body_ctx *ctx,
                                const float *kp_xy, int k)
{
    if (!ctx || !kp_xy || k <= 0) return SAM3D_BODY_E_INVAL;
    free(ctx->kp_xy);
    ctx->kp_xy = (float *)malloc((size_t)k * 2 * sizeof(float));
    if (!ctx->kp_xy) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->kp_xy, kp_xy, (size_t)k * 2 * sizeof(float));
    ctx->n_kp = k;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_set_mask(sam3d_body_ctx *ctx, const uint8_t *mask,
                        int width, int height)
{
    if (!ctx || !mask || width <= 0 || height <= 0) return SAM3D_BODY_E_INVAL;
    size_t bytes = (size_t)width * height;
    free(ctx->mask);
    ctx->mask = (uint8_t *)malloc(bytes);
    if (!ctx->mask) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->mask, mask, bytes);
    ctx->mask_w = width;
    ctx->mask_h = height;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_set_focal(sam3d_body_ctx *ctx, float focal_px)
{
    if (!ctx) return SAM3D_BODY_E_INVAL;
    ctx->focal_hint = focal_px;
    return SAM3D_BODY_E_OK;
}

/* ---------------- pipeline stages ---------------- */

int sam3d_body_run_encoder(sam3d_body_ctx *ctx)
{
    if (!ctx) return SAM3D_BODY_E_INVAL;
    /* When decoder inputs are pre-populated (ref-dump mode), the encoder
     * is already baked into dec_image_emb_chw — skip. */
    if (ctx->dec_in_set) return SAM3D_BODY_E_OK;
    if (!ctx->image_rgb) return SAM3D_BODY_E_INVAL;

    const int is_vith = (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_VITH);

    /* ViT-H runs TopdownAffine to a 512x512 working canvas, then crops
     * 64 columns on each side. DINOv3 uses the configured patch-aligned HxW. */
    const int S = SAM3D_BODY_ENCODER_SIZE;
    const int IMG_H = is_vith ? S : ctx->cfg.image_height;
    const int IMG_W = is_vith ? S : ctx->cfg.image_width;

    /* TopdownAffine: GetBBoxCenterScale + 2× fix_aspect_ratio + get_warp_matrix.
     * If no bbox supplied, use the full image as the bbox. */
    float bbox_xyxy[4];
    if (ctx->has_bbox) {
        memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
    } else {
        bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
        bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
    }
    /* Upstream TopdownAffine always expands to the body prior aspect ratio
     * first (0.75), then fixes again to the actual model input W/H. */
    float aspect_ratio_pre = 0.75f;
    sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                   aspect_ratio_pre, IMG_W, IMG_H,
                                   ctx->self_center, ctx->self_scale,
                                   ctx->self_warp);

    /* Default cam_int (or focal hint override on the diagonal). */
    sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, ctx->self_cam_int);
    if (ctx->focal_hint > 0) {
        ctx->self_cam_int[0] = ctx->focal_hint;
        ctx->self_cam_int[4] = ctx->focal_hint;
    }
    ctx->self_pp_set = 1;

    /* cv2.warpAffine + ImageNet norm + HWC->CHW into the backbone canvas. */
    float *chw = (float *)malloc((size_t)3 * IMG_H * IMG_W * sizeof(float));
    if (!chw) return SAM3D_BODY_E_INVAL;
    int rc_pp = sam3d_body_preprocess_image(ctx->image_rgb, ctx->img_w, ctx->img_h,
                                            ctx->self_warp, IMG_W, IMG_H, chw);
    if (rc_pp != 0) { free(chw); return SAM3D_BODY_E_INVAL; }

    if (!is_vith) {
        if (!ctx->encoder_model) {
            char path[1024];
            snprintf(path, sizeof(path), "%s/sam3d_body_dinov3.safetensors",
                     ctx->cfg.safetensors_dir);
            if (ctx->cfg.verbose)
                fprintf(stderr, "[sam3d_body] loading encoder: %s\n", path);
            ctx->encoder_model = dinov3_load_safetensors(path);
            if (!ctx->encoder_model) {
                fprintf(stderr, "[sam3d_body] failed to load %s\n", path);
                free(chw); return SAM3D_BODY_E_LOAD_FAILED;
            }
            /* sam-3d-body consumes the learned final LayerNorm, not the
             * unparameterized one used by TRELLIS.2. */
            ctx->encoder_model->use_learned_final_norm = 1;
        }
        dinov3_result r = dinov3_encode_from_normalized(ctx->encoder_model, chw,
                                                        IMG_W, IMG_H,
                                                        ctx->cfg.n_threads);
        free(chw);
        if (!r.features) return SAM3D_BODY_E_LOAD_FAILED;

        f32_2d_free(&ctx->encoder_tokens);
        ctx->encoder_tokens.data = r.features;  /* take ownership */
        ctx->encoder_tokens.n = r.n_tokens;
        ctx->encoder_tokens.c = r.dim;

        ctx->enc_grid_h    = ctx->encoder_model->grid_h;
        ctx->enc_grid_w    = ctx->encoder_model->grid_w;
        ctx->enc_n_prefix  = 1 + ctx->encoder_model->n_storage;
        ctx->enc_image_h   = IMG_H;
        ctx->enc_image_w   = IMG_W;
        return SAM3D_BODY_E_OK;
    }

    /* ---- ViT-H (vit_hmr_512_384) path ---- */
    if (!ctx->encoder_model_vith) {
        char path[1024];
        snprintf(path, sizeof(path), "%s/sam3d_body_vith.safetensors",
                 ctx->cfg.safetensors_dir);
        if (ctx->cfg.verbose)
            fprintf(stderr, "[sam3d_body] loading vith encoder: %s\n", path);
        ctx->encoder_model_vith = sam3d_body_vit_load_safetensors(path);
        if (!ctx->encoder_model_vith) {
            fprintf(stderr, "[sam3d_body] failed to load %s\n", path);
            free(chw); return SAM3D_BODY_E_LOAD_FAILED;
        }
    }

