lighttransport/gemm/cpu/sam3d_body/sam3d_body_runner.c
    /* W-axis crop [:, :, :, 64:-64] → (3, 512, 384). chw is (3, S, S) row-major. */
    const int W_crop = S - 128;  /* 384 */
    float *chw_cropped = (float *)malloc((size_t)3 * S * W_crop * sizeof(float));
    if (!chw_cropped) { free(chw); return SAM3D_BODY_E_INVAL; }
    for (int c = 0; c < 3; c++) {
        for (int y = 0; y < S; y++) {
            const float *src = chw + ((size_t)c * S + y) * S + 64;
            float       *dst = chw_cropped + ((size_t)c * S + y) * W_crop;
            memcpy(dst, src, (size_t)W_crop * sizeof(float));
        }
    }
    free(chw);

    sam3d_body_vit_result r = sam3d_body_vit_encode_from_normalized(
            ctx->encoder_model_vith, chw_cropped, W_crop, S, ctx->cfg.n_threads);
    free(chw_cropped);
    if (!r.tokens) return SAM3D_BODY_E_LOAD_FAILED;

    f32_2d_free(&ctx->encoder_tokens);
    ctx->encoder_tokens.data = r.tokens;  /* take ownership */
    ctx->encoder_tokens.n    = r.n_patches;
    ctx->encoder_tokens.c    = r.dim;

    ctx->enc_grid_h   = r.grid_h;
    ctx->enc_grid_w   = r.grid_w;
    ctx->enc_n_prefix = 0;          /* vit_hmr has no CLS / register tokens */
    ctx->enc_image_h  = S;
    ctx->enc_image_w  = W_crop;
    return SAM3D_BODY_E_OK;
}

/* Build the (kv_dim, H, W) post-ray_cond image_emb + (kv_dim, H, W) dense PE +
 * (145, 1024) build_tokens outputs + sam3d_body_camera_batch from the encoder
 * tokens and self-driven preprocess outputs. Result goes directly into the
 * ctx->dec_* fields and ctx->dec_cam_batch, then dec_in_set is set so the
 * downstream forward_full path runs unchanged. */
static int self_drive_decoder_inputs(sam3d_body_ctx *ctx)
{
    if (!ctx->encoder_tokens.data || !ctx->self_pp_set ||
        ctx->enc_grid_h <= 0 || ctx->enc_grid_w <= 0)
        return SAM3D_BODY_E_INVAL;

    int rc = ensure_decoder_loaded(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;

    const sam3d_body_decoder_model *dm = ctx->decoder_model;
    const int Dc = dm->kv_dim;        /* 1280 */
    const int D  = dm->dim;           /* 1024 */
    const int N_q = 145;

    /* Encoder grid (32×32 for DINOv3-H+, 32×24 for vit_hmr_512_384). */
    const int gh = ctx->enc_grid_h;
    const int gw = ctx->enc_grid_w;
    const int n_prefix = ctx->enc_n_prefix;
    const int n_patches = gh * gw;
    if (ctx->encoder_tokens.n != n_prefix + n_patches ||
        ctx->encoder_tokens.c != Dc) {
        fprintf(stderr, "[sam3d_body] encoder shape mismatch: tokens=(%d,%d), "
                        "expected (%d,%d)\n",
                ctx->encoder_tokens.n, ctx->encoder_tokens.c,
                n_prefix + n_patches, Dc);
        return SAM3D_BODY_E_INVAL;
    }

    /* image_emb_pre: drop CLS+register tokens, permute (HW, Dc) → (Dc, H, W). */
    float *img_emb_pre = (float *)malloc((size_t)Dc * gh * gw * sizeof(float));
    if (!img_emb_pre) return SAM3D_BODY_E_INVAL;
    const float *patch_tokens = ctx->encoder_tokens.data + (size_t)n_prefix * Dc;
    const float *no_mask = (const float *)dm->no_mask_embed.data;
    if (!no_mask) { free(img_emb_pre); return SAM3D_BODY_E_LOAD_FAILED; }
    for (int n = 0; n < n_patches; n++) {
        for (int c = 0; c < Dc; c++) {
            img_emb_pre[(size_t)c * n_patches + n] =
                patch_tokens[(size_t)n * Dc + c] + no_mask[c];
        }
    }

    /* ray_cond_xyz at the encoder grid resolution.
     * For vith (W cropped from 512 to 384), shift the affine X-translation
     * by -64 so j=0 in the cropped grid maps back to source pixels via the
     * same x_full[j] = j/a00 - t02_shifted/a00 relation that upstream uses
     * after slicing [:, :, :, 64:-64]. Equivalent to evaluating the original
     * affine at x' = x + 64. */
    const int img_h_for_rays = ctx->enc_image_h;
    const int img_w_for_rays = ctx->enc_image_w;
    const int img_h_for_decoder =
        (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_VITH)
            ? SAM3D_BODY_ENCODER_SIZE : img_h_for_rays;
    const int img_w_for_decoder =
        (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_VITH)
            ? SAM3D_BODY_ENCODER_SIZE : img_w_for_rays;
    float warp_for_rays[6];
    memcpy(warp_for_rays, ctx->self_warp, sizeof(warp_for_rays));
    int ray_img_h = img_h_for_rays;
    int ray_img_w = img_w_for_rays;
    int ray_rect_reinterpret =
        (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_DINOV3 &&
         img_h_for_rays != img_w_for_rays);
    if (ctx->cfg.backbone == SAM3D_BODY_BACKBONE_VITH) {
        ray_img_h = SAM3D_BODY_ENCODER_SIZE;
        ray_img_w = SAM3D_BODY_ENCODER_SIZE;
    }
    float *rays_xyz = (float *)malloc((size_t)gh * gw * 3 * sizeof(float));
    if (!rays_xyz) { free(img_emb_pre); return SAM3D_BODY_E_INVAL; }
    rc = sam3d_body_compute_ray_cond_xyz_ex(ctx->self_cam_int, warp_for_rays,
                                            ray_img_h, ray_img_w,
                                            gh, gw, ray_rect_reinterpret,
                                            rays_xyz);
    if (rc != 0) { free(img_emb_pre); free(rays_xyz); return rc; }

    /* image_emb POST ray_cond. */
    free(ctx->dec_image_emb_chw);
    ctx->dec_image_emb_chw = (float *)malloc((size_t)Dc * gh * gw * sizeof(float));
    if (!ctx->dec_image_emb_chw) {
        free(img_emb_pre); free(rays_xyz); return SAM3D_BODY_E_INVAL;
    }
    rc = sam3d_body_ray_cond_emb_forward(dm, img_emb_pre, rays_xyz, gh, gw,
                                         ctx->cfg.n_threads,
                                         ctx->dec_image_emb_chw);
    free(img_emb_pre);
    free(rays_xyz);
    if (rc != 0) return rc;

    /* dense_pe (image_pe). */
    free(ctx->dec_image_pe_chw);
    ctx->dec_image_pe_chw = (float *)malloc((size_t)Dc * gh * gw * sizeof(float));
    if (!ctx->dec_image_pe_chw) return SAM3D_BODY_E_INVAL;
    rc = sam3d_body_get_dense_pe(dm, gh, gw, ctx->cfg.n_threads,
                                 ctx->dec_image_pe_chw);
    if (rc != 0) return rc;

    /* condition_info (CLIFF). */
    float ori_img_size[2] = { (float)ctx->img_w, (float)ctx->img_h };
    float img_size[2]     = { (float)img_w_for_decoder,
                              (float)img_h_for_decoder };
    float bbox_scale1[1]  = { ctx->self_scale[0] };  /* (1,) — only sw is used */
    float condition_info[3];
    sam3d_body_compute_condition_info(ctx->self_center, bbox_scale1,
                                      ori_img_size, ctx->self_cam_int,
                                      /*use_intrin_center=*/0,
                                      condition_info);

