lighttransport/gemm/cpu/sam3d_body/sam3d_body_runner.c
    /* init_input (525) = [condition_info(3), init_pose(519), init_camera(3)]
     * prev_input (522) = [init_pose(519), init_camera(3)]                  */
    const float *ip = (const float *)dm->init_pose.data;     /* (519,) */
    const float *ic = (const float *)dm->init_camera.data;   /* (3,)   */
    float init_input[525];
    float prev_input[522];
    memcpy(init_input,         condition_info, 3 * sizeof(float));
    memcpy(init_input + 3,     ip,           519 * sizeof(float));
    memcpy(init_input + 3+519, ic,             3 * sizeof(float));
    memcpy(prev_input,         ip,           519 * sizeof(float));
    memcpy(prev_input + 519,   ic,             3 * sizeof(float));

    /* prompt_in (1280,) — single dummy invalid keypoint. */
    float prompt_in[1280];
    rc = sam3d_body_invalid_prompt_token(dm, prompt_in);
    if (rc != 0) return rc;

    /* Build (145, 1024) tokens + posembs. */
    free(ctx->dec_init_x);
    free(ctx->dec_init_xpe);
    ctx->dec_init_x   = (float *)calloc((size_t)N_q * D, sizeof(float));
    ctx->dec_init_xpe = (float *)calloc((size_t)N_q * D, sizeof(float));
    if (!ctx->dec_init_x || !ctx->dec_init_xpe) return SAM3D_BODY_E_INVAL;
    rc = sam3d_body_build_tokens(dm, init_input, prev_input, prompt_in,
                                 ctx->cfg.n_threads,
                                 ctx->dec_init_x, ctx->dec_init_xpe);
    if (rc != 0) return rc;

    ctx->dec_H = gh; ctx->dec_W = gw;

    /* camera_batch. */
    memcpy(ctx->dec_cam_batch.cam_int,      ctx->self_cam_int, 9 * sizeof(float));
    memcpy(ctx->dec_cam_batch.bbox_center,  ctx->self_center,  2 * sizeof(float));
    ctx->dec_cam_batch.bbox_scale = ctx->self_scale[0];
    memcpy(ctx->dec_cam_batch.ori_img_size, ori_img_size, 2 * sizeof(float));
    memcpy(ctx->dec_cam_batch.img_size,     img_size,     2 * sizeof(float));
    memcpy(ctx->dec_cam_batch.affine_trans, warp_for_rays, 6 * sizeof(float));
    ctx->dec_cam_batch.use_intrin_center    = 0;
    ctx->dec_cam_batch.default_scale_factor = 1.0f;

    ctx->dec_in_set = 1;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_run_decoder(sam3d_body_ctx *ctx)
{
    if (!ctx) return SAM3D_BODY_E_INVAL;

    /* Self-driven path (Step 8c-ii): if no debug-override decoder inputs are
     * pre-populated, derive them from encoder_tokens + the bbox-affine /
     * cam_int captured by run_encoder. */
    if (!ctx->dec_in_set) {
        int rc = self_drive_decoder_inputs(ctx);
        if (rc != SAM3D_BODY_E_OK) return rc;
    }

    int rc = ensure_decoder_loaded(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;
    rc = ensure_mhr_loaded(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;

    const int V = SAM3D_BODY_VERTEX_COUNT;
    const int K = SAM3D_BODY_KP_COUNT;

    /* Allocate output buffers (vertices + keypoints). */
    free(ctx->vertices);
    ctx->vertices = (float *)malloc((size_t)V * 3 * sizeof(float));
    if (!ctx->vertices) return SAM3D_BODY_E_INVAL;

    sam3d_body_decoder_full_result r;
    memset(&r, 0, sizeof(r));
    r.pred_vertices = ctx->vertices;

    rc = sam3d_body_decoder_forward_full(
            ctx->decoder_model,
            (struct sam3d_body_mhr_assets_t *)ctx->mhr_assets,
            &ctx->dec_cam_batch,
            ctx->dec_image_emb_chw, ctx->dec_image_pe_chw,
            ctx->dec_H, ctx->dec_W,
            ctx->dec_init_x, ctx->dec_init_xpe,
            ctx->cfg.n_threads, &r);
    if (rc != 0) {
        fprintf(stderr, "[sam3d_body] decoder_forward_full rc=%d\n", rc);
        return rc;
    }
    ctx->n_vertices = V;

    /* mhr_params + cam_t. */
    free(ctx->mhr_params);
    ctx->mhr_params = (float *)malloc(519 * sizeof(float));
    if (!ctx->mhr_params) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->mhr_params, r.mhr_params, 519 * sizeof(float));
    ctx->mhr_params_n = 519;
    memcpy(ctx->cam_t, r.pred_cam_t_world, sizeof(ctx->cam_t));
    /* Focal — diagonal of cam_int (model already estimates s∈cam_t[0] as
     * scale factor; focal lives in cam_int). */
    ctx->focal_px = ctx->dec_cam_batch.cam_int[0];

    /* Populate keypoints from the result. */
    free(ctx->keypoints_3d);
    ctx->keypoints_3d = (float *)malloc((size_t)K * 3 * sizeof(float));
    if (!ctx->keypoints_3d) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->keypoints_3d, r.pred_keypoints_3d, (size_t)K * 3 * sizeof(float));
    ctx->n_kp_3d = K;

    free(ctx->keypoints_2d);
    ctx->keypoints_2d = (float *)malloc((size_t)K * 2 * sizeof(float));
    if (!ctx->keypoints_2d) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->keypoints_2d, r.pred_keypoints_2d, (size_t)K * 2 * sizeof(float));
    ctx->n_kp_2d = K;

    /* Populate faces from the MHR head asset (stored as int64 (F,3)). */
    if (ctx->decoder_model->faces.data && !ctx->faces) {
        int F = (int)ctx->decoder_model->faces.dims[0];
        ctx->faces = (int32_t *)malloc((size_t)F * 3 * sizeof(int32_t));
        if (!ctx->faces) return SAM3D_BODY_E_INVAL;
        const int64_t *src = (const int64_t *)ctx->decoder_model->faces.data;
        for (int i = 0; i < F * 3; i++)
            ctx->faces[i] = (int32_t)src[i];
        ctx->n_faces = F;
    }
    return SAM3D_BODY_E_OK;
}

/* MHR stage is folded into run_decoder (decoder_forward_full runs MHR
 * inline); keep run_mhr as a no-op shim for API symmetry. */
int sam3d_body_run_mhr(sam3d_body_ctx *ctx)
{
    if (!ctx) return SAM3D_BODY_E_INVAL;
    return ctx->vertices ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_run_all(sam3d_body_ctx *ctx)
{
    const int timing = sam3d_body_timing_enabled(ctx);
    double t0 = 0.0, t1 = 0.0, t2 = 0.0, t3 = 0.0;
    if (timing) t0 = sam3d_body_time_ms();
    int rc = sam3d_body_run_encoder(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;
    if (timing) t1 = sam3d_body_time_ms();
    rc = sam3d_body_run_decoder(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;
    if (timing) t2 = sam3d_body_time_ms();
    rc = sam3d_body_run_mhr(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;
    if (timing) {
        t3 = sam3d_body_time_ms();
        fprintf(stderr,
                "[sam3d_body][timing] run_all %.3f ms encoder %.3f decoder %.3f mhr %.3f\n",
                t3 - t0, t1 - t0, t2 - t1, t3 - t2);
    }
    return rc;
}

/* ---------------- readbacks ---------------- */

int sam3d_body_get_encoder_tokens(sam3d_body_ctx *ctx, float *out,
                                  int *out_n_tokens, int *out_dim)
{
    if (!ctx || !out_n_tokens || !out_dim) return SAM3D_BODY_E_INVAL;
    *out_n_tokens = ctx->encoder_tokens.n;
    *out_dim      = ctx->encoder_tokens.c;
    if (out && ctx->encoder_tokens.data)
        memcpy(out, ctx->encoder_tokens.data,
               (size_t)ctx->encoder_tokens.n *
               (size_t)ctx->encoder_tokens.c * sizeof(float));
    return ctx->encoder_tokens.data ? SAM3D_BODY_E_OK
                                    : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

