lighttransport/gemm/cpu/sam3d_body/sam3d_body_runner.c
int sam3d_body_get_mhr_params(sam3d_body_ctx *ctx, float *out, int *out_n)
{
    if (!ctx || !out_n) return SAM3D_BODY_E_INVAL;
    *out_n = ctx->mhr_params_n;
    if (out && ctx->mhr_params)
        memcpy(out, ctx->mhr_params,
               (size_t)ctx->mhr_params_n * sizeof(float));
    return ctx->mhr_params ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_get_cam(sam3d_body_ctx *ctx, float *out_cam_t_xyz,
                       float *out_focal_px)
{
    if (!ctx) return SAM3D_BODY_E_INVAL;
    if (out_cam_t_xyz) memcpy(out_cam_t_xyz, ctx->cam_t, sizeof(ctx->cam_t));
    if (out_focal_px)  *out_focal_px = ctx->focal_px;
    return ctx->focal_px > 0 ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_get_vertices(sam3d_body_ctx *ctx, float *out, int *out_v)
{
    if (!ctx || !out_v) return SAM3D_BODY_E_INVAL;
    *out_v = ctx->n_vertices;
    if (out && ctx->vertices)
        memcpy(out, ctx->vertices,
               (size_t)ctx->n_vertices * 3 * sizeof(float));
    return ctx->vertices ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_get_faces(sam3d_body_ctx *ctx, int32_t *out, int *out_f)
{
    if (!ctx || !out_f) return SAM3D_BODY_E_INVAL;
    *out_f = ctx->n_faces;
    if (out && ctx->faces)
        memcpy(out, ctx->faces,
               (size_t)ctx->n_faces * 3 * sizeof(int32_t));
    return ctx->faces ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_get_keypoints_3d(sam3d_body_ctx *ctx, float *out, int *out_k)
{
    if (!ctx || !out_k) return SAM3D_BODY_E_INVAL;
    *out_k = ctx->n_kp_3d;
    if (out && ctx->keypoints_3d)
        memcpy(out, ctx->keypoints_3d,
               (size_t)ctx->n_kp_3d * 3 * sizeof(float));
    return ctx->keypoints_3d ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int sam3d_body_get_keypoints_2d(sam3d_body_ctx *ctx, float *out, int *out_k)
{
    if (!ctx || !out_k) return SAM3D_BODY_E_INVAL;
    *out_k = ctx->n_kp_2d;
    if (out && ctx->keypoints_2d)
        memcpy(out, ctx->keypoints_2d,
               (size_t)ctx->n_kp_2d * 2 * sizeof(float));
    return ctx->keypoints_2d ? SAM3D_BODY_E_OK : SAM3D_BODY_E_NOT_IMPLEMENTED;
}

/* ---------------- debug overrides ---------------- */

int sam3d_body_debug_override_encoder(sam3d_body_ctx *ctx,
                                      const float *tokens, int n, int dim)
{
    if (!ctx || !tokens || n <= 0 || dim <= 0) return SAM3D_BODY_E_INVAL;
    f32_2d_free(&ctx->encoder_tokens);
    ctx->encoder_tokens.data = (float *)malloc((size_t)n * dim * sizeof(float));
    if (!ctx->encoder_tokens.data) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->encoder_tokens.data, tokens,
           (size_t)n * dim * sizeof(float));
    ctx->encoder_tokens.n = n;
    ctx->encoder_tokens.c = dim;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_debug_override_mhr_params(sam3d_body_ctx *ctx,
                                         const float *params, int n)
{
    if (!ctx || !params || n <= 0) return SAM3D_BODY_E_INVAL;
    free(ctx->mhr_params);
    ctx->mhr_params = (float *)malloc((size_t)n * sizeof(float));
    if (!ctx->mhr_params) return SAM3D_BODY_E_INVAL;
    memcpy(ctx->mhr_params, params, (size_t)n * sizeof(float));
    ctx->mhr_params_n = n;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_debug_override_decoder_inputs(
    sam3d_body_ctx *ctx,
    const float *image_emb_chw,
    const float *image_pe_chw,
    int H, int W,
    const float *init_x,
    const float *init_xpe,
    const float *cam_int,
    const float *bbox_center,
    const float *bbox_scale,
    const float *ori_img_size,
    const float *img_size,
    const float *affine_trans,
    int use_intrin_center,
    float default_scale_factor)
{
    if (!ctx || !image_emb_chw || !image_pe_chw || !init_x || !init_xpe ||
        !cam_int || !bbox_center || !bbox_scale || !ori_img_size ||
        !img_size || !affine_trans || H <= 0 || W <= 0)
        return SAM3D_BODY_E_INVAL;

    int rc = ensure_decoder_loaded(ctx);
    if (rc != SAM3D_BODY_E_OK) return rc;

    const int Dc = ctx->decoder_model->kv_dim;
    const int Nq = 145;
    const int D  = ctx->decoder_model->dim;

    free(ctx->dec_image_emb_chw);
    free(ctx->dec_image_pe_chw);
    free(ctx->dec_init_x);
    free(ctx->dec_init_xpe);

    size_t img_bytes = (size_t)Dc * H * W * sizeof(float);
    size_t tok_bytes = (size_t)Nq * D  * sizeof(float);
    ctx->dec_image_emb_chw = (float *)malloc(img_bytes);
    ctx->dec_image_pe_chw  = (float *)malloc(img_bytes);
    ctx->dec_init_x        = (float *)malloc(tok_bytes);
    ctx->dec_init_xpe      = (float *)malloc(tok_bytes);
    if (!ctx->dec_image_emb_chw || !ctx->dec_image_pe_chw ||
        !ctx->dec_init_x || !ctx->dec_init_xpe) {
        free(ctx->dec_image_emb_chw); ctx->dec_image_emb_chw = NULL;
        free(ctx->dec_image_pe_chw);  ctx->dec_image_pe_chw  = NULL;
        free(ctx->dec_init_x);        ctx->dec_init_x        = NULL;
        free(ctx->dec_init_xpe);      ctx->dec_init_xpe      = NULL;
        return SAM3D_BODY_E_INVAL;
    }
    memcpy(ctx->dec_image_emb_chw, image_emb_chw, img_bytes);
    memcpy(ctx->dec_image_pe_chw,  image_pe_chw,  img_bytes);
    memcpy(ctx->dec_init_x,        init_x,        tok_bytes);
    memcpy(ctx->dec_init_xpe,      init_xpe,      tok_bytes);
    ctx->dec_H = H; ctx->dec_W = W;

    memcpy(ctx->dec_cam_batch.cam_int,      cam_int,      9 * sizeof(float));
    memcpy(ctx->dec_cam_batch.bbox_center,  bbox_center,  2 * sizeof(float));
    ctx->dec_cam_batch.bbox_scale = bbox_scale[0];
    memcpy(ctx->dec_cam_batch.ori_img_size, ori_img_size, 2 * sizeof(float));
    memcpy(ctx->dec_cam_batch.img_size,     img_size,     2 * sizeof(float));
    memcpy(ctx->dec_cam_batch.affine_trans, affine_trans, 6 * sizeof(float));
    ctx->dec_cam_batch.use_intrin_center    = use_intrin_center;
    ctx->dec_cam_batch.default_scale_factor = default_scale_factor;
    ctx->dec_in_set = 1;
    return SAM3D_BODY_E_OK;
}

int sam3d_body_debug_get_decoder_inputs(
    sam3d_body_ctx *ctx,
    const float **image_emb_chw,
    const float **image_pe_chw,
    const float **init_x,
    const float **init_xpe,
    int *H,
    int *W,
    int *Dc,
    int *Nq,
    int *D,
    const float **cam_int,
    const float **bbox_center,
    float *bbox_scale,
    const float **ori_img_size,
    const float **img_size,
    const float **affine_trans,
    int *use_intrin_center,
    float *default_scale_factor)
{
    if (!ctx || !ctx->dec_in_set || !ctx->decoder_model ||
        !ctx->dec_image_emb_chw || !ctx->dec_image_pe_chw ||
        !ctx->dec_init_x || !ctx->dec_init_xpe)
        return SAM3D_BODY_E_INVAL;

    if (image_emb_chw) *image_emb_chw = ctx->dec_image_emb_chw;
    if (image_pe_chw)  *image_pe_chw  = ctx->dec_image_pe_chw;
    if (init_x)        *init_x        = ctx->dec_init_x;
    if (init_xpe)      *init_xpe      = ctx->dec_init_xpe;
    if (H)             *H             = ctx->dec_H;
    if (W)             *W             = ctx->dec_W;
    if (Dc)            *Dc            = ctx->decoder_model->kv_dim;
    if (Nq)            *Nq            = 145;
    if (D)             *D             = ctx->decoder_model->dim;
    if (cam_int)       *cam_int       = ctx->dec_cam_batch.cam_int;
    if (bbox_center)   *bbox_center   = ctx->dec_cam_batch.bbox_center;
    if (bbox_scale)    *bbox_scale    = ctx->dec_cam_batch.bbox_scale;
    if (ori_img_size)  *ori_img_size  = ctx->dec_cam_batch.ori_img_size;
    if (img_size)      *img_size      = ctx->dec_cam_batch.img_size;
    if (affine_trans)  *affine_trans  = ctx->dec_cam_batch.affine_trans;
    if (use_intrin_center)
        *use_intrin_center = ctx->dec_cam_batch.use_intrin_center;
    if (default_scale_factor)
        *default_scale_factor = ctx->dec_cam_batch.default_scale_factor;
    return SAM3D_BODY_E_OK;
}
